Repository: avi-software/red-alert
Catalog: po/*.po
Languages: he

source: Check for alarms
he: בדוק אזעקות

source: Safe Time:
he: זמן בטוח

source: No alerts right now!
he: אין אזעקות כרגע!

source: Red Alert
he: צבע אדום

source: Settings
he: הגדרות

source: Select alerts area:
he: בחר אזור אזעקות:

source: Notify for all areas
he: התרע עבור כל האיזורים

source: Notify by city
he: התרע עבור עיר

source: Select city:
he: בחר עיר

source: Sound activate
he: השמע צליל
